Table of Contents
 Class SectionStiffnesses
Namespace
IdeaRS.OpenModel.Concrete.CheckResult
Assembly
IdeaRS.OpenModel.dll
Section stiffnesses
public class SectionStiffnesses
Inheritance
object
SectionStiffnesses
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Alfa
rotation around x-axis
public double Alfa { get; set; }
Property Value
double
 EAx
axial stiffness
public double EAx { get; set; }
Property Value
double
 EDyz
product moment stiffness
public double EDyz { get; set; }
Property Value
double
 EIy
bending stiffness
public double EIy { get; set; }
Property Value
double
 EIz
bending stiffness
public double EIz { get; set; }
Property Value
double
 EccX
eccentricity in x-direction
public double EccX { get; set; }
Property Value
double
 EccY
eccentricity in y-direction
public double EccY { get; set; }
Property Value
double
 EccZ
eccentricity in y-direction
public double EccZ { get; set; }
Property Value
double
 GAy
shear stiffness
public double GAy { get; set; }
Property Value
double
 GAz
shear stiffness
public double GAz { get; set; }
Property Value
double
 GIx
torsion stiffness
public double GIx { get; set; }
Property Value
double
 Edit this page